/* The informative text of the alert displayed when prompting to restore Spectacle's default shortcuts */
"AlertInformativeTextRestoreDefaults" = "Haluatko palauttaa oletusarvoiset näppäinoikotiet? Menetät itse määrittämäsi oikotiet.";

/* The informative text of the alert displayed when prompting to run Spectacle in the background */
"AlertInformativeTextRunningInBackground" = "Spectacle suoritetaan taustalla ilman valikkopalkin valikkoa.\n\nVoit käyttää Spectaclen asetuksia napsauttamalla Spectaclen kuvaketta Launchpadissa tai avaa Spectacle Finderistä.";

/* The informative text of the alert displayed when a shortcut is already in use */
"AlertInformativeTextShortcutAlreadyInUse" = "Oikotie \"%@\" on jo käytössä. Valitse jokin muu oikotie.";

/* The informative text of the alert displayed when a system-wide shortcut is already in use */
"AlertInformativeTextSystemWideShortcutAlreadyUsed" = "Oikotie \"%@\" on jo järjestelmän käytössä.\n\nVoit käyttää tätä oikotietä Spectaclessa, jos vaihdat nykyisen oikotien toiseksi Järjestelmäasetuksien kohdassa Näppäimistö.";

/* The message text of the alert displayed when prompting to restore Spectacle's default shortcuts */
"AlertMessageTextRestoreDefaults" = "Tämä palauttaa Spectaclen oletusarvoiset näppäinoikotiet";

/* The message text of the alert displayed when prompting to run Spectacle in the background */
"AlertMessageTextRunningInBackground" = "Spectacle suoritetaan taustalla";

/* The message text of the alert displayed when a shortcut is invalid */
"AlertMessageTextShortcutValidationError" = "Oikotie %@ on jo käytössä.";

/* The button label used in the affirmative */
"ButtonLabelAffirmative" = "OK";

/* The button label used in the negative */
"ButtonLabelNegative" = "Peruuta";

/* The menu item title that displays the application to disable shortcuts for */
"MenuItemTitleDisableShortcutsForApplication" = "ohjelmassa %@";

/* The preferences window button that restores the default shortcuts */
"PreferencesButtonTitleRestoreDefaults" = "Palauta oletukset…";

/* The preferences window checkbox that launches Spectacle at login */
"PreferencesCheckboxTitleLaunchAtLogin" = "Käynnistä Spectacle kirjauduttaessa";

/* The preferences window label preceding the run mode pop up button, e.g. "Run" "in the status menu" */
"PreferencesLabelRunMode" = "Suorita";

/* The preferences window run mode option that runs Spectacle as a background application */
"PreferencesMenuItemTitleRunInBackground" = "taustaohjelmana";

/* The preferences window run mode option that shows Spectacle in the status menu */
"PreferencesMenuItemTitleRunInStatusMenu" = "valikkopalkissa";

/* The preferences window modifier key legend label for the Command key */
"PreferencesModifierLabelCommand" = "Komento";

/* The preferences window modifier key legend label for the Control key */
"PreferencesModifierLabelControl" = "Ctrl";

/* The preferences window modifier key legend label for the Option key */
"PreferencesModifierLabelOption" = "Optio";

/* The preferences window modifier key legend label for the Shift key */
"PreferencesModifierLabelShift" = "Vaihto";

/* The preferences window title of the Basics section of shortcuts */
"PreferencesSectionTitleBasics" = "Perustoiminnot";

/* The preferences window title of the Corners section of shortcuts */
"PreferencesSectionTitleCorners" = "Kulmat";

/* The preferences window title of the Displays & Thirds section of shortcuts */
"PreferencesSectionTitleDisplaysAndThirds" = "Näytöt ja kolmannekset";

/* The preferences window title of the Halves section of shortcuts */
"PreferencesSectionTitleHalves" = "Puolikkaat";

/* The preferences window title of the History section of shortcuts */
"PreferencesSectionTitleHistory" = "Historia";

/* The preferences window title of the Resize section of shortcuts */
"PreferencesSectionTitleResize" = "Koko";

/* The preferences window label for the Make Larger shortcut recorder */
"PreferencesShortcutLabelMakeLarger" = "Suurenna";

/* The preferences window label for the Make Smaller shortcut recorder */
"PreferencesShortcutLabelMakeSmaller" = "Pienennä";

/* The preferences window label for the Bottom Half shortcut recorder */
"PreferencesShortcutLabelMoveToBottomHalf" = "Alapuoli";

/* The preferences window label for the Center shortcut recorder */
"PreferencesShortcutLabelMoveToCenter" = "Keskitys";

/* The preferences window label for the Fullscreen shortcut recorder */
"PreferencesShortcutLabelMoveToFullscreen" = "Koko näyttö";

/* The preferences window label for the Left Half shortcut recorder */
"PreferencesShortcutLabelMoveToLeftHalf" = "Vasen puoli";

/* The preferences window label for the Lower Left shortcut recorder */
"PreferencesShortcutLabelMoveToLowerLeft" = "Alavasen";

/* The preferences window label for the Lower Right shortcut recorder */
"PreferencesShortcutLabelMoveToLowerRight" = "Alaoikea";

/* The preferences window label for the Next Display shortcut recorder */
"PreferencesShortcutLabelMoveToNextDisplay" = "Seuraava näyttö";

/* The preferences window label for the Next Third shortcut recorder */
"PreferencesShortcutLabelMoveToNextThird" = "Seuraava kolmasosa";

/* The preferences window label for the Previous Display shortcut recorder */
"PreferencesShortcutLabelMoveToPreviousDisplay" = "Edellinen näyttö";

/* The preferences window label for the Previous Third shortcut recorder */
"PreferencesShortcutLabelMoveToPreviousThird" = "Edellinen kolmasosa";

/* The preferences window label for the Right Half shortcut recorder */
"PreferencesShortcutLabelMoveToRightHalf" = "Oikea puoli";

/* The preferences window label for the Top Half shortcut recorder */
"PreferencesShortcutLabelMoveToTopHalf" = "Yläpuoli";

/* The preferences window label for the Upper Left shortcut recorder */
"PreferencesShortcutLabelMoveToUpperLeft" = "Ylävasen";

/* The preferences window label for the Upper Right shortcut recorder */
"PreferencesShortcutLabelMoveToUpperRight" = "Yläoikea";

/* The preferences window label for the Redo shortcut recorder */
"PreferencesShortcutLabelRedoLastMove" = "Tee uudelleen";

/* The preferences window label for the Undo shortcut recorder */
"PreferencesShortcutLabelUndoLastMove" = "Kumoa";

/* The shortcut recorder label displayed when the shorcut recorder is cleared and ready to record a new shortcut */
"ShortcutRecorderLabelClickToRecord" = "Nauhoita napsauttamalla";

/* The shortcut recorder label displayed when the shorcut recorder is recording a shortcut */
"ShortcutRecorderLabelEnterShortcut" = "Syötä oikotie";

/* The shortcut recorder label displayed when the shorcut recorder is recording a shortcut and the shortcut recorder does not have a previously recorded shortcut */
"ShortcutRecorderLabelStopRecording" = "Pysäytä nauhoitus";

/* The shortcut recorder label displayed when the shorcut recorder is recording a shortcut and the shortcut recorder does have a previously recorded shortcut */
"ShortcutRecorderLabelUseExisting" = "Käytä aiempaa";
